src/Documents/ПриходДенежныхСредств/ПриходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВалют</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВСтруктуреДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскаяТранзакция</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиВалют/ОстаткиВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиВалют</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПриходДенежныхСредств/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Валюта = ОбщийПовтИсп.ОсновнаяВалютаУчета();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Дата = НачалоДня(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	УчётнаяСумма = Сумма * Курс / Кратность;	
	
	// проведение по регистру "Остатки по счетам"
	ДвижениеОстатки = Движения.ОстаткиПоСчетам.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеОстатки, Ссылка);
	ДвижениеОстатки.СуммаУчетн = УчётнаяСумма;
	ДвижениеОстатки.Период = Дата;
	
	УчётДоходы = Не (Счет.Забалансовый Или НеУчитыватьВСтруктуреДоходов);
	УчётДолговыеОбязательства = (Не Счет.Забалансовый) И ЗначениеЗаполнено(Должник);
	
	Если УчётДоходы Тогда  // для забалансовых счетов нет смысла считать расходы, нужно только контролировать остатки
		
		// проведение по регистру "Доходы"
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеДоходы, Ссылка);
		ДвижениеДоходы.СуммаУчетн = УчётнаяСумма;
		ДвижениеДоходы.Период = Дата;
		
	КонецЕсли;
	
	// формируем движения по регистру "Долговые обязательства"
	Если УчётДолговыеОбязательства Тогда
		
		ДвижениеДолги = Движения.ДолговыеОбязательства.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ДвижениеДолги, Ссылка);
		ДвижениеДолги.Должник = Ссылка.Должник;
		ДвижениеДолги.Период = Дата;
		
	КонецЕсли;
	
	РегистрыНакопления.ОстаткиВалют.ОтразитьПоступлениеВалюты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
